# Yosys synthesis script for design_top
# Read verilog files
read_verilog -nomem2reg ./design_file.v

# Technology mapping
hierarchy -top design_top
proc
techmap -D NO_LUT -map +/adff2dff.v

# Synthesis
synth -top design_top -flatten
clean

# LUT mapping
abc -lut 4


# Check
synth -run check
stat
# Clean and output blif
opt_clean -purge
stat
write_blif design_top.blif
